---
kind: type
id: T:Autodesk.Revit.DB.AssemblyMemberDifferentCategory
source: html/e244624d-2bdb-ded8-dfcc-255259880dc6.htm
---
# Autodesk.Revit.DB.AssemblyMemberDifferentCategory

The two assembly members being compared have different category

## Syntax (C#)
```csharp
public class AssemblyMemberDifferentCategory : AssemblyMemberDifference
```